Revit 2024 API
SolidSolidCutUtils.GetCuttingSolids Method
 Gets all the solids which cut the input element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static ICollection<ElementId> GetCuttingSolids(
	Element element
)
Visual Basic
Public Shared Function GetCuttingSolids ( _
	element As Element _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetCuttingSolids(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The input element.
Return Value
 The ids of the solids which cut the input element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace